Revit 2025 API
EndTreatmentType.Create Method
Overload List
Name | Description
Create(Document) |  Creates a new EndTreatmentType in a document.
Create(Document, String) |  Creates a new EndTreatmentType in a document and adds the input string to the endTreatment parameter.
Top
See Also
Reference
EndTreatmentType Class
Autodesk.Revit.DB.Structure Namespace